WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetUnsignedLong_Client_Request-4.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetUnsignedLong</a:Action>
    <a:MessageID>urn:uuid:0336d3f4-7345-49f1-9940-81c35b158733</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetUnsignedLong xmlns="http://tempuri.org/">
      <inULong>50</inULong>
    </RetUnsignedLong>
  </s:Body>
</s:Envelope>